export default [
  "Принятые в 60-х годах планы технической революции вызвали на факультете \"Приборостроение\" МГТУ им. Н.Э.Баумана (тогда МВТУ) необходимость подготовки специалистов системного, комплексного подхода к проектированию систем управления техническими объектами, предприятиями, отраслями народного хозяйства. В стране появилась достаточная номенклатура элементов вычислительной техники и универсальные вычислительные машины. Необходимо было начать выпуск специалистов, способных применять при проектировании технических систем, как специализированные ЭВМ в, так и универсальные ЭВМ. Эти специалисты должны быть знакомы с научными основами и технологией процессов сбора, передачи, обработки и хранения больших объемов информации, использовании информации в управлении. Факультет \"Приборостроение\" начал на всех кафедрах коренное обновление учебных специальностей, учебных планов и учебных программ.",
  "В частности, в 1964 году на факультете был введен учебный курс \"Прикладная теория информации\", и в том же году была образована на базе кафедры П-7 новая кафедра \"Автоматические информационные устройства\". Заведующим кафедрой был избран Георгий Николаевич Толстоусов - проф., д.т.н., Главный конструктор систем управления авиационной техники, Лауреат Государственной премии.",
  {
    position: "right",
    photo: {
      url: "images/tolstousov.webp",
      description: "Заведующий кафедрой П7 (1964-1980 гг.) проф., д.т.н., Толстоусов Г.Н.",
      width: "200px",
      height: "248px"
    },
    content: [
      "Преподавателями кафедры П-7 на этом этапе стали руководители подразделений научно-исследовательских и опытно-конструкторских предприятий, выпускающих технику на уровне лучших мировых образцов того времени: Боевкин В. И., Герман Д. Я., Ивин Л. Ф., Корольков И. В., Масленников В.П., Никонов Б. С., Буканов Н. П., Павлов Ю. Н., Переверткин С. М. Чуть позже преподавателями стали ассистент Ходатаева Г. А. и аспиранты кафедры Дядюнов А. Н. и Шустров В. И.",
      "Учебный процесс на новой кафедре строился таким образом, чтобы выпускник кафедры был не просто инженер - узкий специалист в информационной технике, а инженер-системотехник - специалист с широким кругозором, способный разобраться в предметной области, в смежных областях, поставить задачу, которую должна решать информационная система, грамотно составить и согласовать техническое задание, выбрать основные принципы, заказать основные элементы системы, собрать систему, отладить, провести испытания, выпустить техническую документацию и организовать эксплуатацию системы.",
      "Учебные программы были составлены так, чтобы выпускники кафедры умели:",
      "— Разработать информационно-измерительный процесс. Подобрать или разработать измерительные приборы, обеспечить требуемую точность, надежность, достоверность процесса измерения. Организовать, если необходимо, распознавание и подготовку к передаче информации самой разнообразной природы."
    ]
  },
  "— Организовать передачу полученной информации по многоканальной линии связи. Обеспечить требуемую помехозащищенность, уменьшить избыточность, достигнуть необходимой скорости передачи информации. Разработать или подобрать элементы: преобразователи, коммутаторы, шифраторы и др. Организовать упаковку сигналов в телеметрический кадр.",
  "— Осуществить прием переданной информации. Поскольку на кафедре не предусматривалась подготовка по радиопередающей аппаратуре, то обеспечивалась только подготовка по методам приема случайного зашумленного сигнала, по методам первичной и вторичной обработке телеметрических сигналов, распределению информации по потребителям.",
  "— Предусмотреть обработку полученной информации. Отфильтровать сбои и помехи. Разработать алгоритмы обработки информации. Разработать специализированные вычислители для реализации алгоритмов обработки. Организовать методы и средства хранения информации. Если разрабатывается система управления, то - разработать и реализовать алгоритм выработки управляющего сигнала, алгоритм принятия решения, разработать технические задания для специализированных вычислителей и т.д.",
  "— Обеспечить разработку и эксплуатацию на основе вышеуказанных пунктов информационно - измерительной системы. Разработать сопроводительную документацию.",
  {
    position: "left",
    photo: {
      url: "images/ivin.webp",
      description: "к.т.н, доцент Ивин Л.Ф.",
      width: "150px",
      height: "207px"
    },
    content: [
      "Обучение по всем вышеуказанным направлениям было обеспечено соответствующими учебными курсами, лабораторными работами, курсовыми работами и проектами.",
      "Большое внимание при организации лабораторных работ и курсовых проектов обращалось на то, чтобы методические указания не сковывали инициативу студентов, чтобы студент самостоятельно мог использовать методики расчета, изготовить макет устройства, подобрать элементы схемы и отладить её. Реализовывался принцип - все, что сделано собственными руками, запоминается и усваивается всерьез и надолго. Огромную работу по созданию таких лабораторий провел доцент Ивин Л. Ф.",
      "Проф. Толстоусов Г. Н., доценты Буканов Н. П., Никонов Б.С., Герман Д.Я., Павлов Ю.Н., Дядюнов А. Н. поставили курсы лекций по основам проектирования информационно-измерительных устройств и систем, прикладной теории информации, теории динамической точности и др."
    ]
  },
  "На первом этапе научная работа кафедры была связана, в основном, с созданием автоматических и информационных систем и устройств нового поколения. Преподаватели кафедры в период с 1965 по 1982 год завершили исследования, заказанные ведущими предприятиями страны, по следующей тематике:",
  {
    position: "right",
    photo: {
      url: "images/german.webp",
      description: "к.т.н, доцент Герман Д.Я.",
      width: "126px",
      height: "178px"
    },
    content: [
      "— Системы ориентации и навигации искусственных спутников, использующих гравитационное и магнитное поле Земли. Подобные системы не требуют энергетических и весовых затрат на стабилизацию ИСЗ и используются для космических аппаратов с большим временем эксплуатации. Результаты этих работ опубликованы в монографиях Толстоусова Г. Н., Боевкина В. И., Павлова Ю. Н., Селезнева А. В., в статьях этих преподавателей и инж. Недашковского В. М. и в отчетах по хоздоговорным работам с Институтом проблем управления АН СССР, Институтом прикладной математики им. М. С. Келдыша, НПО им. Решетнева. За участие в обработке результатов испытания таких систем награжден орденом \"Знак Почета\" проф. Павлов Ю. Н.",
      "— Проблемы, связанные с передачей больших объемов информации в многоканальных системах. Разрабатывались новые и оценивались известные методы сжатия потоков информации, методы адаптивного сжатия и восстановления, необходимые для увеличения скорости передачи информации. Разрабатывались способы фильтрации полезных сигналов от шумов, способы борьбы со сбоями, методы вторичной обработки информации, необходимые для автоматизации процесса обработки информации в телеметрических системах, используемых при испытаниях и эксплуатации самолетов и ракет. Результаты этих работ опубликованы в статьях и отчетах Германа Д. Я., Муратова А. Н., Морозова Н. Н., Свалова Ю. Л. по хоздоговорным работам с НПО \"Энергия\", Научно-исследовательским институтом измерительной техники, НПО \"Прибор\" и использовались в системах экспресс-анализа причин летных происшествий, анализа информации \"черных ящиков\" и в системах определения технического состояния самолетов гражданской авиации.",
    ]
  },
  "— Акселерометры и другие приборы первичной информации, использующие в качестве чувствительного элемента резонатор. Под руководством профессора Королькова И.В. были проведены углубленные исследования, позволившие совместно с МПКБ \"Восход\" создать прецизионный датчик измерения давления, на основе которого разработаны измерительные системы с метрологическими характеристиками эталонных систем. В дальнейшем эти идеи нашли свое развитие в работах КБ, созданного Журавлевым А. И. - выпускником кафедры, учеником проф. Королькова И. В.",
  "— Профессор Боевкин В.И. возглавил исследования по полунатурному моделированию и идентификации автоматических информационных устройств. Были начаты исследования по возможности разложения и сжатия стационарных процессов с помощью неортогональной системы функций. Доц. Никонов Б. С. продолжил работы по совершенствованию малогабаритного трехкоординатного стенда, имитирующего пространственное угловое движение летательного аппарата.",
  "— Доцент Ивин Л.Ф., вел активные проектные работы по созданию новых измерительных систем и приборов в КБ \"Геофизика\".",
  "— Доцент Дядюнов А. Н. участвовал в проектировании многоканальных телеметрических систем для космических летательных аппаратов, разрабатываемых в ОКБ им. Лавочкина, и для самолетов гражданской авиации, разрабатывавшихся в НИИ гражданской авиации. Результаты этой работы вошли в монографию Дядюнова А. Н., Онищенко Ю. А., Сенина А. И.",
  "— Доцент Масленников В. П. был привлечен НПО \"Энергия\" к работам по оптимизации структур, алгоритмов и технических характеристик систем технического контроля и диагностики, используемых при испытании и проектировании космической техники.",
  {
    position: "left",
    photo: {
      url: "images/pavlov.webp",
      description: "д.т.н, профессор Павлов Ю.Н.",
      width: "150px",
      height: "174px"
    },
    content: [
      "С 1968 по 1980 годы заместителями заведующего кафедрой работали: по учебной работе - Герман Д. Я., по научно - исследовательской работе - Павлов Ю. Н.",
      "С 1980 по 1985 год кафедрой руководил профессор, д.т.н., Летчик-космонавт СССР, дважды Герой Советского Союза Елисеев А. С.",
      "Перестройка учебного процесса на кафедре началась с 1982 года. На базе первых массовых отечественных персональных компьютеров ДВК-2 начинают вводиться учебные курсы и практикумы, предвосхищающие массовую компьютеризацию в управлении, в промышленности и науке.",
      "С 1982 года впервые в МГТУ студентам начинают читать курсы по программированию на языках Бейсик и Паскаль. Вводятся курсы по элементам и системам микропроцессорной техники. В учебный практикум вводятся персональные компьютеры, учебные микро-ЭВМ, специализированные периферийные устройства, программируемые контроллеры. На кафедре начинают работать преподавателями Ю. П. Яблонько и выпускники кафедры В. М. Недашковский и А. Н. Муратов."
    ]
  },
  {
    position: "right",
    photo: {
      url: "images/eliseev.webp",
      description: "Заведующий кафедрой ИУ3 (1980 -1985 гг.) проф., д.т.н., летчик-космонавт, дважды Герой СССР Елисеев А.С.",
      width: "150px",
      height: "158px"
    },
    content: [
      "Доцентами Дядюновым А.Н., Недашковским В.М., Сваловым Ю.Л., Германом Д.Я., Муратовым А.М., Яблонько Ю.П. были поставлены курсы лекций по проектированию систем сбора и передачи информации, микропроцессорных устройств и программного обеспечения информационных систем, систем отображения и регистрации информации.",
      "По инициативе профессора Елисеева А.С активизировались научные работы совместно с такими ведущими организациями по разработке и использованию телеметрических систем как НИИ измерительной техники, НПО \"Энергия\", что позволило впоследствии группе, возглавляемой Сваловым Ю.Л., разработать конкурентоспособную систему регистрации и анализа телеметрической информации нового поколения. Базовыми организациями для кафедры стали НИИ измерительной техники и Институт проблем управления РАН, где часть студентов стала принимать участие в научных и прикладных исследованиях и практических разработках информационных систем.",
      "В 1985 году А.С. Елисеев назначается Ректором МВТУ и в 1987 году уходит с кафедры. Заведующим кафедрой ИУ-3 избирается проф., д.т.н. В.В. Девятков, специалист в области теории автоматизированной разработки систем и устройств логического управления, теории и практики искусственного интеллекта и новых информационных технологий, долгое время возглавлявший лабораторию Института Проблем Управления РАН."
    ]
  },
  {
    position: "left",
    photo: {
      url: "/images/first-pc.webp",
      description: "Первые персональные компьютеры в МВТУ появились на кафедре П7",
      width: "370px",
      height: "256px"
    },
    content: [
      "Продолжается коренная переработка всех учебных дисциплин, связанная с компьютеризацией всех отраслей страны. Основным принципом в построении дисциплин специальности и специализаций стали следующие положения:",
      "— Микропроцессор и интегральная схема становятся атомарными элементами в изучаемых элементах и системах.",
      "— Компьютер - основное средство управления и научного исследования.",
      "— Сети - основные каналы обмена информацией, в том числе управляющими сигналами.",
      "— Базы данных и интеллектуальные базы знаний - основные средства накопления, хранения и обработки информации.",
      "Модифицируются и вводятся новые курсы по сетевым технологиям, базам данных, системам искусственного интеллекта, корпоративным системам, современным средствам микропроцессорной техники, используемой для сбора, обработки и передачи информации.",
      "К преподавательской работе привлечены к.т.н. Самохин В.П., к.т.н. Петросян О.Г., выпускники кафедры Иванов К.Г., Селихов Ю.Р., Оганов В.И., Сидякин И.М., Терехова Н. Ю., Федоров С.В. Заместителем заведующего кафедрой с 1982 года работает доц. Недашковский В. М."
    ]
  },
  {
    position: "right",
    photo: {
      url: "images/nedashkovsky-vm.webp",
      description: "к.т.н., доцент Недашковскй В.М.",
      width: "371px",
      height: "297px"
    },
    content: [
      "Дисциплины этой специальности посвящены изучению систем первичной обработки информации об объекте (температура, давление, влажность, параметры движущегося объекта и т.д.), съема, преобразования и обработки информации. В связи с этим кафедра должное внимание уделяет развитию теоретических и прикладных вопросов разработки микропроцессорных устройств и систем для обработки сигналов и применению современных информационных технологий и методов искусственного интеллекта:",
      "— проектирование и разработка интеллектуальных информационных систем на современной микропроцессорной базе,",
      "— съем информации с датчиков, преобразование ее в форму, воспринимаемую компьютером,",
      "— анализ сигналов и выявление необходимых для дальнейшей обработки сведений, построение математических моделей для обработки сигналов,",
      "— выдачу результатов обработки в удобном виде на экран компьютера или другие графические устройства,",
      "— разработка систем телеметрии,",
      "— накопление информации в базах данных,",
      "— сжатие, кодирование информации,",
      "— передачу информации по каналам связи и компьютерным сетям на дальнее расстояние."
    ]
  },
  "Кафедра осуществляет подготовку специалистов к профессиональной деятельности в области разработки и использования микропроцессорных систем контроля и анализа работы сложных технических объектов, телеметрических систем авиационного и космического назначения, локальных и глобальных информационно-измерительных сетей и комплексов, блоков сопряжения компьютеров с периферийной аппаратурой, видео технических и аудиовизуальных устройств и систем, интеллектуальных микропроцессорных устройств, систем измерения и принятия решений.",
  "Основные направления подготовки специалистов и научной работы кафедры ИУ-З в этот период:",
  "— современные информационные системы и технологии приема, преобразования и передачи сигналов различного типа;",
  "— телекоммуникационные и телеметрические системы;",
  "— интеллектуальные микропроцессорные блоки сопряжения компьютеров с периферийной аппаратурой;",
  "— информационно-измерительные сети и комплексы;",
  "— видео технические и аудиовизуальные мультимедийные устройства и системы;",
  "— корпоративные информационные системы.",
  "К 2000 г. кафедре становится ясно, что программы дисциплин, читаемых на кафедре, практикум и выполняемые лабораторные работы, в наибольшей степени соответствуют специальности \"Информационные системы и технологии\" с ориентацией на телекоммуникационные применения. В связи с этим с 2000 г. кафедра переходит на подготовку специалистов по указанной специальности и получает название \"Информационные системы и телекоммуникации\".",
  "Программы подготовки выпускников кафедры в части ее общепрофессиональных, специальных и факультативных дисциплинах базируются теперь на трех основополагающих принципах.",
  "— Сохраняя требования государственных стандартов к перечню и содержанию общепрофессиональных дисциплин ориентировать знания, преподносимые дисциплинами по информационным системам и технологиям, на сетевые телекоммуникационные приложения.",
  "— В специальных дисциплинах, не регламентируемых государственными стандартами, дать знания не только о программных информационных системах и технологиях, ориентированных на сетевые телекоммуникационные применения, но и предоставить знания об аппаратных особенностях реализации современных крупномасштабных телекоммуникационных систем сбора, обработки и передачи информации.",
  "— В части специальных и факультативных дисциплин дать знания о проектировании на современной микропроцессорной базе аппаратно-программных устройств, отвечающих за сбор, обработку и передачу информации и сигналов различного типа в информационных распределенных (телекоммуникационных) системах.",
  "В рамках новой специальности были введены новые дисциплины: \"Операционные системы\", \"Информационные сети\", \"Информационная безопасность и защита информации\", \"Цифровая обработка сигналов\", \"Мультимедиа технология\", \"Корпоративные информационные системы\" и др.",
  "Под руководством проф. Девяткова В. В. на кафедре получили развитие новые научные направления, связанные с разработкой теоретических аспектов и программных информационно-управляющих систем, базирующихся на логических подходах к формированию и обработке знаний методами искусственного интеллекта, нечеткой логики, нейронных сетей."
];
