import {ISubject} from "../types/subjects";

export const programming = [
  {
    id: 35,
    coverUrl: "images/C++.webp",
    title: "C/C++",
    description: "Информатика. Методы и средства проектирования информационных систем и технологий. Учебный практикум на ЭВМ. Микропроцессорные устройства обработки сигналов.",
    degrees: ["b1", "m"],
    subjectIds: [66, 87, 91, 381]
  },
  {
    id: 24,
    coverUrl: "images/ARM.webp",
    title: "ARM",
    description: "Методы и средства проектирования информационных систем и технологий. Инструментальные средства информационных систем.",
    degrees: ["b1"],
    subjectIds: [87, 90]
  },
  {
    id: 31,
    coverUrl: "images/NET.webp",
    title: ".NET",
    description: "Технологии программирования. Разработка мультисервисных приложений для мобильных операционных систем.",
    degrees: ["b1", "b2"],
    subjectIds: [307, 401]
  },
  {
    id: 25,
    coverUrl: "images/Android.webp",
    title: "Android",
    description: "Разработка программного обеспечения. Разработка мультисервисных приложений для мобильных операционных систем.",
    degrees: ["b1"],
    subjectIds: [102, 401]
  },
  {
    id: 100102,
    coverUrl: "images/Spring.webp",
    title: "Spring",
    description: "Разработка программного обеспечения.",
    degrees: ["b1"],
    subjectIds: [102]
  },
  {
    id: 100395,
    coverUrl: "images/OpenCV.webp",
    title: "OpenCV",
    description: "Алгоритмы определения параметров объектов в видеопотоке.",
    degrees: ["m"],
    subjectIds: [395]
  },
  {
    id: 11,
    coverUrl: "images/Python.webp",
    title: "Python",
    description: "Обработка и распознавание биометрии. Цифровая обработка изображений. Анализ и прогнозирование временных рядов. Технологии разработки информационных систем для анализа больших объемов информации.",
    degrees: ["b1", "m"],
    subjectIds: [93, 376, 391, 402]
  },
  {
    id: 14,
    coverUrl: "images/SQL.webp",
    title: "SQL",
    description: "Управление данными. Системы управления постреляционными базами данных.",
    degrees: ["b1", "m"],
    subjectIds: [78, 394]
  },
  {
    id: 100378,
    coverUrl: "images/Erlang.webp",
    title: "Erlang",
    description: "Программное обеспечение телекоммуникационных систем.",
    degrees: ["m"],
    subjectIds: [378]
  },
  {
    id: 10090,
    coverUrl: "images/Yocto.webp",
    title: "Yocto",
    description: "Инструментальные средства информационных систем.",
    degrees: ["b1"],
    subjectIds: [90]
  },
  {
    id: 10190,
    coverUrl: "images/Buildroot.webp",
    title: "Buildroot",
    description: "Инструментальные средства информационных систем.",
    degrees: ["b1"],
    subjectIds: [90]
  },
  {
    id: 101102,
    coverUrl: "images/React.webp",
    title: "React",
    description: "Разработка программного обеспечения.",
    degrees: ["b1"],
    subjectIds: [102]
  },
  {
    id: 102102,
    coverUrl: "images/Linux.webp",
    title: "Linux",
    description: "Разработка программного обеспечения.",
    degrees: ["b1"],
    subjectIds: [102]
  },
  {
    id: 100383,
    coverUrl: "images/Django.webp",
    title: "Django",
    description: "Протоколы и интерфейсы информационных систем.",
    degrees: ["m"],
    subjectIds: [383]
  },
  {
    id: 100401,
    coverUrl: "images/Xamarin.webp",
    title: "Xamarin",
    description: "Разработка мультисервисных приложений для мобильных операционных систем.",
    degrees: ["b1"],
    subjectIds: [401]
  },
  {
    id: 100116,
    coverUrl: "images/HTML.webp",
    title: "HTML/CSS/JS",
    description: "Технологическая практика.",
    degrees: ["b1"],
    subjectIds: [116]
  },
  {
    id: 100390,
    coverUrl: "images/Shower.webp",
    title: "Shower",
    description: "Мультимедиа технологии.",
    degrees: ["m"],
    subjectIds: [390]
  },
  {
    id: 54,
    coverUrl: "images/Csh.webp",
    title: "C#",
    description: "Технологии программирования. Разработка мультисервисных приложений для мобильных операционных систем.",
    degrees: ["b1", "b2"],
    subjectIds: [307, 401]
  },
  {
    id: 101401,
    coverUrl: "images/Kivy.webp",
    title: "Kivy",
    description: "Разработка мультисервисных приложений для мобильных операционных систем.",
    degrees: ["b1"],
    subjectIds: [401]
  },
  {
    id: 103102,
    coverUrl: "images/Java.webp",
    title: "Java",
    description: "Разработка программного обеспечения.",
    degrees: ["b1"],
    subjectIds: [102]
  },
  {
    id: 104102,
    coverUrl: "images/IntelliJ.webp",
    title: "IntelliJ IDEA",
    description: "Разработка программного обеспечения.",
    degrees: ["b1"],
    subjectIds: [102]
  },
  {
    id: 10290,
    coverUrl: "images/Beagle.webp",
    title: "Beagle Bone Black",
    description: "Инструментальные средства информационных систем.",
    degrees: ["b1"],
    subjectIds: [90]
  },
  {
    id: 71,
    coverUrl: "images/uC.webp",
    title: "µC/OS-II",
    description: "Методы и средства проектирования информационных систем и технологий. Программное обеспечение встроенных систем. Микропроцессорные устройства обработки сигналов.",
    degrees: ["b1", "m"],
    subjectIds: [87, 380, 381]
  },
  {
    id: 100380,
    coverUrl: "images/MISRA.webp",
    title: "MISRA C",
    description: "Программное обеспечение встроенных систем.",
    degrees: ["m"],
    subjectIds: [380]
  },
  {
    id: 81,
    coverUrl: "images/Aurora.webp",
    title: "Операционная система Аврора",
    description: "Информатика. Мультимедиа технологии. Разработка мультисервисных приложений для мобильных операционных систем.",
    degrees: ["b1", "m"],
    subjectIds: [66, 390, 401]
  },
  {
    id: 84,
    coverUrl: "images/Eclipse.webp",
    title: "Интегрированная среда разработки Eclipse",
    description: "Методы и средства проектирования информационных систем и технологий. Микропроцессорные устройства обработки сигналов.",
    degrees: ["b1", "m"],
    subjectIds: [87, 381]
  }
];

export const informationTechnologies = [
  {
    id: 3,
    coverUrl: "images/Matlab.webp",
    title: "Matlab",
    description: "Теория информационных процессов и систем. Основы теории управления и цифровой обработки сигналов. Информационные технологии. Моделирование и надежность систем.",
    degrees: ["b1", "m", "b2"],
    subjectIds: [80, 81, 85, 318, 391, 402]
  },
  {
    id: 100377,
    coverUrl: "images/EMF.webp",
    title: "EMF",
    description: "Методы исследования и моделирования информационных процессов и технологий.",
    degrees: ["m"],
    subjectIds: [377]
  },
  {
    id: 101390,
    coverUrl: "images/Adobe.webp",
    title: "Adobe Premiere",
    description: "Мультимедиа технологии.",
    degrees: ["m"],
    subjectIds: [390]
  },
  {
    id: 12,
    coverUrl: "images/MSProject.webp",
    title: "MS Project",
    description: "Системная инженерия. Экономика и управление инновационными проектами.",
    degrees: ["m"],
    subjectIds: [379, 385]
  },
  {
    id: 100409,
    coverUrl: "images/CrypTool.webp",
    title: "CrypTool",
    description: "Криптографические протоколы и стандарты.",
    degrees: ["m"],
    subjectIds: [409]
  },
  {
    id: 100391,
    coverUrl: "images/RProject.webp",
    title: "R-project",
    description: "Анализ и прогнозирование временных рядов.",
    degrees: ["m"],
    subjectIds: [391]
  },
  {
    id: 100379,
    coverUrl: "images/Capella.webp",
    title: "Capella",
    description: "Системная инженерия.",
    degrees: ["m"],
    subjectIds: [379]
  },
  {
    id: 101377,
    coverUrl: "images/AnyLogic.webp",
    title: "AnyLogic",
    description: "Методы исследования и моделирования информационных процессов и технологий.",
    degrees: ["m"],
    subjectIds: [377]
  },
  {
    id: 100107,
    coverUrl: "images/1C.webp",
    title: "1C",
    description: "Корпоративные информационные системы.",
    degrees: ["b1"],
    subjectIds: [107]
  },
  {
    id: 100106,
    coverUrl: "images/WindowsServer.webp",
    title: "Windows Server",
    description: "Системы управления в информационных сетях.",
    degrees: ["b1"],
    subjectIds: [106]
  },
  {
    id: 100114,
    coverUrl: "images/Google.webp",
    title: "Поиск информации",
    description: "Технологии поиска и анализа персонифицированной информации.",
    degrees: ["b1"],
    subjectIds: [114]
  },
  {
    id: 82,
    coverUrl: "images/LibreOffice.webp",
    title: "Персональная информационная технология",
    description: "Методы и средства проектирования информационных систем и технологий. Микропроцессорные устройства обработки сигналов.",
    degrees: ["b1", "m"],
    subjectIds: [87, 381]
  }
];

export const networks = [
  {
    id: 21,
    coverUrl: "images/ZigBee.webp",
    title: "ZigBee",
    description: "Проектирование информационных и телекоммуникационных систем. Беспроводные технологии в информационных системах.",
    degrees: ["m"],
    subjectIds: [224, 386]
  },
  {
    id: 29,
    coverUrl: "images/GSM.webp",
    title: "GSM",
    description: "Проектирование информационных и телекоммуникационных систем. Беспроводные технологии в информационных системах.",
    degrees: ["m"],
    subjectIds: [224, 386]
  },
  {
    id: 34,
    coverUrl: "images/Cisco.webp",
    title: "Cisco",
    description: "Инфокоммуникационные системы и сети. Проектно-технологическая практика. Инжиниринг компьютерных сетей.",
    degrees: ["b1", "m"],
    subjectIds: [76, 117, 392]
  },
  {
    id: 100392,
    coverUrl: "images/GNS3.webp",
    title: "GNS3",
    description: "Инжиниринг компьютерных сетей.",
    degrees: ["m"],
    subjectIds: [392]
  },
  {
    id: 56,
    coverUrl: "images/Wifi.webp",
    title: "Wi-Fi",
    description: "Проектирование информационных и телекоммуникационных систем. Беспроводные технологии в информационных системах.",
    degrees: ["m"],
    subjectIds: [224, 386]
  },
  {
    id: 57,
    coverUrl: "images/Bluetooth.webp",
    title: "Bluetooth",
    description: "Проектирование информационных и телекоммуникационных систем. Беспроводные технологии в информационных системах.",
    degrees: ["m"],
    subjectIds: [224, 386]
  },
  {
    id: 58,
    coverUrl: "images/LoRa.webp",
    title: "LoRa",
    description: "Проектирование информационных и телекоммуникационных систем. Беспроводные технологии в информационных системах.",
    degrees: ["m"],
    subjectIds: [224, 386]
  },
  {
    id: 59,
    coverUrl: "images/OMNeT++.webp",
    title: "OMNeT++",
    description: "Проектирование информационных и телекоммуникационных систем. Беспроводные технологии в информационных системах.",
    degrees: ["m"],
    subjectIds: [224, 386]
  }
];

export const ai = [
  {
    id: 100226,
    coverUrl: "images/Neuroph.webp",
    title: "Neuroph",
    description: "Нейронные сети.",
    degrees: ["m"],
    subjectIds: [226]
  },
  {
    id: 10,
    coverUrl: "images/SWI.webp",
    title: "SWI Prolog",
    description: "Интеллектуальные системы и технологии. Представление знаний в информационных системах.",
    degrees: ["b1", "m"],
    subjectIds: [86, 223]
  },
  {
    id: 100225,
    coverUrl: "images/PyTorch.webp",
    title: "PyTorch",
    description: "Мультиагентные интеллектуальные системы.",
    degrees: ["m"],
    subjectIds: [225]
  }
];

export const electronics = [
  {
    id: 4,
    coverUrl: "images/Intel.webp",
    title: "Intel",
    description: "Архитектура информационных систем. Программное обеспечение встроенных систем. Проектирование цифровых устройств на программируемых логических интегральных схемах.",
    degrees: ["b1", "m"],
    subjectIds: [84, 380, 388]
  },
  {
    id: 100381,
    coverUrl: "images/CodeComposer.webp",
    title: "Code Composer Studio",
    description: "Микропроцессорные устройства обработки сигналов.",
    degrees: ["m"],
    subjectIds: [381]
  },
  {
    id: 50,
    coverUrl: "images/Texas.webp",
    title: "Texas Instruments",
    description: "Методы и средства проектирования информационных систем и технологий. Схемотехника электронных устройств. Курсовая работа. Микропроцессорная техника и цифровые автоматы.",
    degrees: ["b1"],
    subjectIds: [87, 99, 100]
  },
  {
    id: 10098,
    coverUrl: "images/LabView.webp",
    title: "LabView",
    description: "Метрология и информационно-измерительные устройства.",
    degrees: ["b1"],
    subjectIds: [98]
  },
  {
    id: 62,
    coverUrl: "images/MultiSim.webp",
    title: "MultiSim",
    description: "Методы и средства проектирования информационных систем и технологий. Электроника. Схемотехника электронных устройств. Схемотехника электронных устройств. Курсовая работа.",
    degrees: ["b1"],
    subjectIds: [87, 96, 97, 99]
  },
  {
    id: 66,
    coverUrl: "images/Cosmic.webp",
    title: "Космические телекоммуникации",
    description: "Схемотехника электронных устройств. Схемотехника электронных устройств. Курсовая работа.",
    degrees: ["b1"],
    subjectIds: [97, 99]
  },
  {
    id: 70,
    coverUrl: "images/Components.webp",
    title: "Электронные компоненты",
    description: "Методы и средства проектирования информационных систем и технологий. Электроника. Схемотехника электронных устройств. Схемотехника электронных устройств. Курсовая работа.",
    degrees: ["b1"],
    subjectIds: [87, 96, 97, 99]
  },
  {
    id: 72,
    coverUrl: "images/ModelSim.webp",
    title: "ModelSim",
    description: "Микропроцессорная техника и цифровые автоматы. Проектирование цифровых устройств на программируемых логических интегральных схемах.",
    degrees: ["b1", "m"],
    subjectIds: [100, 388]
  },
  {
    id: 73,
    coverUrl: "images/Quartus.webp",
    title: "Intel Quartus Prime",
    description: "Микропроцессорная техника и цифровые автоматы. Программное обеспечение встроенных систем. Проектирование цифровых устройств на программируемых логических интегральных схемах.",
    degrees: ["b1", "m"],
    subjectIds: [100, 380, 388]
  },
  {
    id: 75,
    coverUrl: "images/Altera.webp",
    title: "Altera DE2-115",
    description: "Программное обеспечение встроенных систем. Проектирование цифровых устройств на программируемых логических интегральных схемах.",
    degrees: ["m"],
    subjectIds: [380, 388]
  },
  {
    id: 79,
    coverUrl: "images/Mathcad.webp",
    title: "Математические расчеты в Mathcad",
    description: "Микропроцессорные устройства обработки сигналов. Электротехника. НИР.",
    degrees: ["b1", "m"],
    subjectIds: [381, 404]
  },
  {
    id: 10087,
    coverUrl: "images/LibreCAD.webp",
    title: "САПР для черчения и проектирования",
    description: "Методы и средства проектирования информационных систем и технологий.",
    degrees: ["b1"],
    subjectIds: [87]
  },
  {
    id: 85,
    coverUrl: "images/Debug.webp",
    title: "Тестирование и отладка цифровых устройств",
    description: "Методы и средства проектирования информационных систем и технологий. Микропроцессорные устройства обработки сигналов.",
    degrees: ["b1", "m"],
    subjectIds: [87, 381]
  }
];

const ZE = 36;

export const details: ISubject[] = [
  {
    id: 404,
    title: "Электротехника. НИР",
    degree: "b1",
    hours: [0, 0, 0, 6*ZE, 0, 0, 0, 0],
    description: "Настоящая рабочая программа дисциплины разработана кафедрой ИУ3 «Информационные системы и телекоммуникации» в соответствии с самостоятельно устанавливаемым образовательным стандартом (СУОС), основной профессиональной образовательной программой, учебным планом МГТУ им. Н.Э. Баумана по направлению подготовки 09.03.02 «Информационные системы и технологии». Цель изучения дисциплины – состоит в формировании у студентов базовых знаний об электротехнических устройствах с распределенными параметрами, их анализе, расчете первичных и вторичных параметров, изучении способов описания входных и выходных сигналов длинных линий, оценке качества их работы, приобретении практических навыков самостоятельного проектирования линий передачи с применением современных программных средств. Полученные знания дают более глубокое понимание значимости будущей специальности, формируют ответственное отношение к профессиональной деятельности. Общий объем дисциплины составляет 2 зачетные единицы (з. е.), 72 ч. В том числе: 4 семестр - 2 з. е. (72 часа.).",
    faculty: {
      name: "Кафедра ФН7, Электротехника и промышленная электроника",
      link: "http://hoster.bmstu.ru/~fn7/"
    },
    tutors: [
      "Осипова Нина Витальевна"
    ],
    technologies: [
      {
        logoUrl: "icons/Mathcad.webp",
        link: "https://www.mathcad.com/"
      }
    ]
  },
  {
    id: 100,
    title: "Микропроцессорная техника и цифровые автоматы",
    degree: "b1",
    hours: [0, 0, 0, 0, 0, 5*ZE, 0, 0],
    description: "Целью курса является приобретение теоретических знаний и практических навыков в области проектирования аппаратных цифровых устройств и микропроцессорных систем. В первой части курса рассматривается синтез комбинационных и последовательностных схем, описание и реализации цифровых конечных автоматов, о системах счисления, представлении чисел в цифровых системах, способах выполнения арифметических операций над ними. Рассматривается язык описания аппаратного состава SystemVerilog и аппаратная реализация цифровых устройств на программируемых логических интегральных схемах (ПЛИС). Во второй части курса рассматривается архитектура микропроцессорных устройств, формируются первоначальные навыки их проектирования и программирования. Рассматриваются общие сведения о микропроцессорных устройствах, архитектуры микроконтроллеров, основы программирования на языке ассемблера, способы организации интерфейсов в микропроцессорных системах. В курс входят лабораторные работы по изучению ассемблера и периферийных модулей микроконтроллера MSP430 от Texas Instruments, организации обмена данными в микропроцессорной системе. Курс содержит восемь лабораторных работ и два домашних задания.",
    faculty: {
      name: "Кафедра ИУ3, Информационные системы и технологии",
      link: "https://iu3.bmstu.ru"
    },
    tutors: [
      "Лычков Игорь Игоревич",
      "Федоров Сергей Владимирович",
      "Страхов Михаил Дмитриевич"
    ],
    technologies: [
      {
        logoUrl: "icons/TI.webp",
        link: "https://www.ti.com/"
      },
      {
        logoUrl: "icons/ModelSim.webp",
        link: "https://resources.sw.siemens.com/en-US/fact-sheet-modelsim-cost-effective-simulation-fact-sheet"
      },
      {
        logoUrl: "icons/Quartus.webp",
        link: "https://www.intel.com/content/www/us/en/software/programmable/quartus-prime/overview.html"
      }
    ]
  },
  {
    id: 84,
    title: "Архитектура информационных систем",
    degree: "b1",
    hours: [0, 0, 0, 0, 0, 4*ZE, 0, 0],
    description: "Курс охватывает такие вопросы организации вычислений в компьютерных системах, как структура и функционирование центрального процессора, взаимодействие процессора с основной памятью, организация ввода-вывода данных. Особое внимание уделяется механизмам ускорения вычислений: использованию кэш-памяти, конвейеризации вычислений, распараллеливанию вычислений на нескольких процессорах. Курс включает лабораторные работы, посвященные составлению программ на языке ассемблера i8086, а также освоению периферийных интерфейсов персонального компьютера.",
    faculty: {
      name: "Кафедра ИУ3, Информационные системы и технологии",
      link: "https://iu3.bmstu.ru"
    },
    tutors: [
      "Лычков Игорь Игоревич"
    ],
    technologies: [
      {
        logoUrl: "icons/Intel.webp",
        link: "https://www.intel.com/content/www/us/en/products/programmable.html"
      }
    ]
  },
  {
    id: 85,
    title: "Информационные технологии",
    degree: "b1",
    hours: [0, 0, 0, 0, 0, 0, 5*ZE, 0],
    description: "В курсе представлены основы цифровой связи и беспроводной передачи данных, на примере современных систем LTE/5G. Рассматривается обобщенная структура цифровой системы передачи данных, различные виды модуляций/манипуляций, классификация каналов связи и систем передачи данных, показатели качества передачи цифровой информации и помехоустойчивость. В лабораторном практикуме симулируются цифровые системы связи с разными параметрами, а также радиочастотное планирование систем подвижной связи.",
    faculty: {
      name: "Кафедра ИУ3, Информационные системы и технологии",
      link: "https://iu3.bmstu.ru"
    },
    tutors: [
      "Асмарян Альберт Эдуардович"
    ],
    technologies: [
      {
        logoUrl: "icons/Matlab.webp",
        link: "https://www.mathworks.com/products/matlab.html"
      }
    ]
  },
  {
    id: 80,
    title: "Теория информационных процессов и систем",
    degree: "b1",
    hours: [0, 0, 0, 0, 5*ZE, 0, 0, 0],
    description: "В курсе изложены основные понятия теории информации, понятие количественной меры информации и соотношения для вычисления количества информации, содержащийся в физических системах-источниках информации. Приводится классическая схема передачи информации по каналам связи с помехами. Рассматриваются вопросы оптимального и помехозащищённого кодирования, вопросы пропускной способности каналов связи, вопросы дискретизации непрерывных процессов по времени и по уровню, вопросы статистической обработки информации, статистического, корреляционного и многофакторного регрессионного анализов. Приводятся примеры практических приложений и аспекты теории инженерного эксперимента.",
    faculty: {
      name: "Кафедра ИУ3, Информационные системы и технологии",
      link: "https://iu3.bmstu.ru"
    },
    tutors: [
      "Бабкин Павел Сергеевич",
      "Руденкова Юлия Сергеевна"
    ],
    technologies: [
      {
        logoUrl: "icons/Matlab.webp",
        link: "https://www.mathworks.com/products/matlab.html"
      }
    ]
  },
  {
    id: 81,
    title: "Основы теории управления и цифровой обработки сигналов",
    degree: "b1",
    hours: [0, 0, 0, 0, 6*ZE, 0, 0, 0],
    description: "Цель преподавания дисциплины состоит в обеспечение специалиста знаниями в части теории управления и теории цифровой обработки сигналов, которая необходима при проектировании информационных систем и средств телекоммуникаций. В курсе изучаются способы применения и методы выбора параметров непрерывных и дискретных фильтров и других цифровых устройств преобразования сигналов в информационной системе; методики анализа и синтеза линейных систем управления, импульсных систем управления, непрерывно-импульсных систем управления, методики расчета точности при случайных воздействиях; методы проектирования непрерывных и дискретных фильтров; методы обработки случайных процессов в дискретных системах. Используются программные математические пакеты MathCAD, MATLAB+Simulink.",
    faculty: {
      name: "Кафедра ИУ3, Информационные системы и технологии",
      link: "https://iu3.bmstu.ru"
    },
    tutors: [
      "Недашковский Вячеслав Михайлович",
      "Кадырбаева Анастасия Рустемовна"
    ],
    technologies: [
      {
        logoUrl: "icons/Matlab.webp",
        link: "https://www.mathworks.com/products/matlab.html"
      }
    ]
  },
  {
    id: 66,
    title: "Информатика",
    degree: "b1",
    hours: [5*ZE, 3*ZE, 0, 0, 0, 0, 0, 0],
    description: "Цель дисциплины состоит в освоении студентами современных информационных технологий, формирование представления о задачах, реализуемых с их помощью, методах их решения, формирование алгоритмического мышления. Дисциплина реализует базовую подготовку по программированию, рассчитанную на студентов младших курсов.",
    faculty: {
      name: "Кафедра ИУ3, Информационные системы и технологии",
      link: "https://iu3.bmstu.ru"
    },
    tutors: [
      "Тренин Сергей Алексеевич",
      "Видьманов Дмитрий Александрович",
      "Попов Владислав Сергеевич",
      "Локтев Даниил Алексеевич"
    ],
    technologies: [
      {
        logoUrl: "icons/C++.webp",
        link: "https://isocpp.org/std/the-standard"
      },
      {
        logoUrl: "icons/Aurora.webp",
        link: "https://auroraos.ru/"
      }
    ]
  },
  {
    id: 87,
    title: "Методы и средства проектирования информационных систем и технологий",
    degree: "b1",
    hours: [0, 0, 0, 0, 0, 0, 4*ZE, 0],
    description: "Дисциплина включает основные сведения о методах и средствах проектирования современных информационных устройств, систем и технологий. Рассматриваются темы, посвященные отбору исходных данных для проектирования, моделированию разрабатываемых устройств, систем и технологий, их разработке, тестированию и использованию. В лабораторном практикуме по дисциплине используются программные средства Multisim, Code Composer Studio, UML, а также лабораторные стенды MSP-EXP430FG4618 с набором информационных элементов (сенсоров) для измерения давления, температуры, влажности, расхода газа, положения, уровня, освещенности, и т.п.",
    faculty: {
      name: "Кафедра ИУ3, Информационные системы и технологии",
      link: "https://iu3.bmstu.ru"
    },
    tutors: [
      "Выхованец Валерий Святославович",
      "Германчук Александр Игоревич"
    ],
    technologies: [
      {
        logoUrl: "icons/ARM.webp",
        link: "https://www.arm.com/"
      },
      {
        logoUrl: "icons/C++.webp",
        link: "https://isocpp.org/std/the-standard"
      },
      {
        logoUrl: "icons/TI.webp",
        link: "https://www.ti.com/"
      },
      {
        logoUrl: "icons/MultiSIm.webp",
        link: "https://www.multisim.com/"
      },
      {
        logoUrl: "icons/AutoDesk.webp",
        link: "https://www.autodesk.com/"
      },
      {
        logoUrl: "icons/qC.webp",
        link: "https://weston-embedded.com/micrium-software"
      },
      {
        logoUrl: "icons/LibreOffice.webp",
        link: "https://ru.libreoffice.org/"
      },
      {
        logoUrl: "icons/LibreCad.webp",
        link: "https://www.librecad.org/"
      },
      {
        logoUrl: "icons/Eclipse.webp",
        link: "https://eclipseide.org/"
      },
      {
        logoUrl: "icons/IE.webp",
        link: "https://grouper.ieee.org/groups/1149/10/"
      }
    ]
  },
  {
    id: 91,
    title: "Учебный практикум на ЭВМ",
    degree: "b1",
    hours: [2*ZE, 0, 0, 0, 0, 0, 0, 0],
    description: "Дисциплина посвящена изучению современных информационных технологий, формированию представления о задачах, реализуемых с их помощью, методов их решения, формированию алгоритмического мышления. Дисциплина реализует базовую подготовку по программированию на языке С++",
    faculty: {
      name: "Кафедра ИУ3, Информационные системы и технологии",
      link: "https://iu3.bmstu.ru"
    },
    tutors: [
      "Тренин Сергей Алексеевич",
      "Видьманов Дмитрий Александрович",
      "Попов Владислав Сергеевич",
      "Локтев Даниил Алексеевич"
    ],
    technologies: [
      {
        logoUrl: "icons/C++.webp",
        link: "https://isocpp.org/std/the-standard"
      }
    ]
  },
  {
    id: 381,
    title: "Микропроцессорные устройства обработки сигналов",
    degree: "m",
    hours: [0, 3 * ZE, 0, 0],
    description: "",
    faculty: {
      name: "Кафедра ИУ3, Информационные системы и технологии",
      link: "https://iu3.bmstu.ru"
    },
    tutors: [
      "Выхованец Валерий Святославович",
      "Германчук Александр Игоревич"
    ],
    technologies: [
      {
        logoUrl: "icons/TISTUDIO.webp",
        link: "https://www.ti.com/tool/CCSTUDIO"
      },
      {
        logoUrl: "icons/C++.webp",
        link: "https://isocpp.org/std/the-standard"
      },
      {
        logoUrl: "icons/qC.webp",
        link: "https://weston-embedded.com/micrium-software"
      },
      {
        logoUrl: "icons/MathCad.webp",
        link: "https://www.mathcad.com/"
      },
      {
        logoUrl: "icons/LibreOffice.webp",
        link: "https://ru.libreoffice.org/"
      },
      {
        logoUrl: "icons/Eclipse.webp",
        link: "https://eclipseide.org/"
      },
      {
        logoUrl: "icons/IE.webp",
        link: "https://grouper.ieee.org/groups/1149/10/"
      }
    ]
  },
  {
    id: 401,
    title: "Разработка мультисервисных приложений для мобильных операционных систем",
    degree: "b1",
    hours: [0, 0, 0, 0, 0, 0, 0, 2*ZE],
    description: "Курс включает изучение теоретических основ проектирования и разработки мультисервисных приложений для мобильных операционных систем с использованием Си-подобного языка программирования, освоение концепций кроссплатформенной разработки, создание графического пользовательского интерфейса приложений, элементов управления, а также изучение платформо-зависимого кода, ресурсов, стилей, привязки данных.",
    faculty: {
      name: "Кафедра ИУ3, Информационные системы и технологии",
      link: "https://iu3.bmstu.ru"
    },
    tutors: [
      "Видьманов Дмитрий Александрович"
    ],
    technologies: [
      {
        logoUrl: "icons/Android.webp",
        link: "https://developer.android.com/"
      },
      {
        logoUrl: "icons/NET.webp",
        link: "https://dotnet.microsoft.com/en-us/"
      },
      {
        logoUrl: "icons/Xamarin.webp",
        link: "https://learn.microsoft.com/en-us/previous-versions/xamarin/"
      },
      {
        logoUrl: "icons/C#.webp",
        link: "https://learn.microsoft.com/en-us/dotnet/csharp/"
      },
      {
        logoUrl: "icons/Kivy.webp",
        link: "https://kivy.org/doc/stable/"
      },
      {
        logoUrl: "icons/Aurora.webp",
        link: "https://auroraos.ru/"
      }
    ]
  },
  {
    id: 318,
    title: "Моделирование и надежность систем",
    degree: "b2",
    hours: [0, 0, 0, 0, 0, 0, 3*ZE, 0],
    description: "Цель преподавания дисциплины состоит в обеспечение специалиста знаниями в части моделирования динамических систем, теории надежности и теории массового обслуживания, которые необходимы при проектировании информационных систем и средств телекоммуникаций. После успешной сдачи экзамена по курсу студент сможет эффективно решать практические задачи, связанные с моделированием динамических систем и выбором численных методов решения дифференциальных уравнений, положенных в основу этих моделей. Также он сможет проводить оценку требуемых параметров систем массового обслуживания и осуществлять расчет, а, при необходимости, улучшение, надежности технических систем.",
    faculty: {
      name: "Кафедра ИУ3, Информационные системы и технологии",
      link: "https://iu3.bmstu.ru"
    },
    tutors: [
      "Осипова Нина Витальевна"
    ],
    technologies: [
      {
        logoUrl: "icons/Matlab.webp",
        link: "https://www.mathworks.com/products/matlab.html"
      }
    ]
  },
  {
    id: 102,
    title: "Разработка программного обеспечения",
    degree: "b1",
    hours: [0, 0, 0, 0, 0, 3*ZE, 0, 0],
    description: "Курс состоит из двух разделов. Первый раздел посвящен проектированию приложений для ОС Андроид и, в особенности, проектированию приложений с неуправляемым кодом написанным на языке C++. Рассматриваются вопросы кросс-компиляции и подключения внешних Linux библиотек к Android приложению, интерфейс JNI. Во втором разделе изучаются вопросы проектирования внешней (frontend) и внутренней (backend) части сервисов на языке Java на примере Spring Boot и React.",
    faculty: {
      name: "Кафедра ИУ3, Информационные системы и технологии",
      link: "https://iu3.bmstu.ru"
    },
    tutors: [
      "Сидякин Иван Михайлович"
    ],
    technologies: [
      {
        logoUrl: "icons/Android.webp",
        link: "https://developer.android.com/"
      },
      {
        logoUrl: "icons/Spring.webp",
        link: "https://spring.io/"
      },
      {
        logoUrl: "icons/React.webp",
        link: "https://react.dev/"
      },
      {
        logoUrl: "icons/Kernel.webp",
        link: "https://docs.kernel.org/"
      },
      {
        logoUrl: "icons/Java.webp",
        link: "https://www.java.com/ru/"
      },
      {
        logoUrl: "icons/IntelliJ.webp",
        link: "https://www.jetbrains.com/ru-ru/idea/"
      }
    ]
  },
  {
    id: 395,
    title: "Алгоритмы определения параметров объектов в видеопотоке",
    degree: "m",
    hours: [0, 0, 0, 2*ZE],
    description: "Дисциплина посвящена формированию у студентов знаний о современных алгоритмах определения параметров объектов в видеопотоке. Рассматриваются основные понятия и термины, принятые при работе с информацией и обработкой изображений; методы получения первичной информации об объекте, алгоритмы захвата и отслеживания движущегося объекта, распознавание образа объекта",
    faculty: {
      name: "Кафедра ИУ3, Информационные системы и технологии",
      link: "https://iu3.bmstu.ru"
    },
    tutors: [
      "Локтев Даниил Алексеевич"
    ],
    technologies: [
      {
        logoUrl: "icons/OpenCV.webp",
        link: "https://opencv.org/"
      }
    ]
  },
  {
    id: 93,
    title: "Обработка и распознавание биометрической информации",
    degree: "b1",
    hours: [0, 0, 0, 0, 0, 0, 3*ZE, 0],
    description: "Рассматриваются методы и технологии распознавания биометрической информации: по отпечаткам пальцев, по лицу, по геометрии руки, по радужной оболочке глаза, ДНК. А также другие методы распознавания: по голосу, по походке, по инфракрасной термографии с использованием высокоуровневого языка программирования Python.",
    faculty: {
      name: "Кафедра ИУ3, Информационные системы и технологии",
      link: "https://iu3.bmstu.ru"
    },
    tutors: [
      "Петросян Олег Гарегинович"
    ],
    technologies: [
      {
        logoUrl: "icons/Python.webp",
        link: "https://www.python.org/"
      }
    ]
  },
  {
    id: 376,
    title: "Цифровая обработка изображений",
    degree: "m",
    hours: [0, 0, 0, 4*ZE],
    description: "Изображение - это главный источник информации для биологического или технического агента, осуществляющего действия в реальном мире. Современные средства получения цифровых изображений очень дешевы и распространены, поэтому последовательность изображений или видеопоток зачастую рассматривается как Big data, обработку которого доверяют как классическим математическим моделям, так и новым цифровым технологиям. В целом автоматическая обработка цифровых изображений – самый выразительный пример развития искусственного интеллекта. Дисциплина «Цифровая обработка изображений» формирует фундаментальную структуру мировоззрения и необходимые практические компетенции в области методов создания и преобразования цифровых изображений для последующей машинной обработки интеллектуальными системами. В первом модуле дисциплины «Представление цифрового изображения» рассматриваются основы цифровых изображений, анализируется зрительная система человека, исследуются методы восстановления цифровых изображений. Во втором модуле дисциплины «Улучшение цифрового изображения и распознавание образов на цифровых изображениях» рассматриваются методы пространственного улучшения изображений, частотные методы улучшения изображений, методы обработки цветных цифровых изображений, морфологической обработки изображений, методы компьютерного зрения с использованием классического и глубокого машинного обучения в информационных системах. Лабораторные работы построены на базе языка Python с использованием библиотек scikit-image, OpenCV, scikit-learn, tensorflow.",
    faculty: {
      name: "Кафедра ИУ3, Информационные системы и технологии",
      link: "https://iu3.bmstu.ru"
    },
    tutors: [
      "Алфимцев Александр Николаевич",
      "Большаков Владислав Эдуардович"
    ],
    technologies: [
      {
        logoUrl: "icons/Python.webp",
        link: "https://www.python.org/"
      }
    ]
  },
  {
    id: 391,
    title: "Анализ и прогнозирование временных рядов",
    degree: "m",
    hours: [0, 0, 0, 3*ZE],
    description: "Курс посвящен изучению теоретических основ и современных методов анализа динамики объектов, описываемой временными рядами. Курс включает изучение следующих вопросов: - методов построения одномерных и многомерных параметрических моделей стационарных и нестационарных временных рядов (ARIMA, SARIMA, VAR, VECM и др.) и оценки их адекватности, - методов определения типа нестационарности процесса, прогнозирования и оценивания ошибок прогноза; - методов обнаружения структурных изменений (аномалий) в процессах и проверки наличия взаимосвязей между процессами. Процедуры применения изучаемых методов иллюстрируются решением прикладных задач (обнаружение и предупреждение аномалий, сетевых атак, нештатных ситуаций, прогнозирование и обнаружение таких явлений, как кризисы, финансовые пузыри, рецессии и пр.), выполняемых по реальным данным с использованием технологий Python Matlab и R. Программа курса предусматривает лекции (11 часов), семинарские и практические занятия (11 часов). Для решения этих прикладных задач в курсе предусмотрено выполнение 3-х лабораторных работ (11 часов).",
    faculty: {
      name: "Кафедра ИУ3, Информационные системы и технологии",
      link: "https://iu3.bmstu.ru"
    },
    tutors: [
      "Гребенюк Елена Алексеевна"
    ],
    technologies: [
      {
        logoUrl: "icons/Matlab.webp",
        link: "https://www.mathworks.com/products/matlab.html"
      },
      {
        logoUrl: "icons/Python.webp",
        link: "https://www.python.org/"
      },
      {
        logoUrl: "icons/R-project.webp",
        link: "https://www.r-project.org/"
      }
    ]
  },
  {
    id: 402,
    title: "Технологии разработки информационных систем для анализа больших объемов информации",
    degree: "m",
    hours: [0, 0, 0, 2*ZE],
    description: "В курсе рассматриваются задачи анализа данных: классификация, кластеризация, регрессия, понижение размерности. Изучаются такие методы их решения, как логистическая регрессия, метод опорных векторов (линейный и с применением ядер), методы отбора и кодировки признаков, регрессия, случайный лес, AdaBoost, ассоциативного поиска и др. Цель курса состоит в освоении студентами современных информационных технологий, формирование представлений о задачах, реализуемых с их помощью, и методах их решения, формирование алгоритмического мышления.",
    faculty: {
      name: "Кафедра ИУ3, Информационные системы и технологии",
      link: "https://iu3.bmstu.ru"
    },
    tutors: [
      "Гребенюк Елена Алексеевна"
    ],
    technologies: [
      {
        logoUrl: "icons/Matlab.webp",
        link: "https://www.mathworks.com/products/matlab.html"
      },
      {
        logoUrl: "icons/Python.webp",
        link: "https://www.python.org/"
      }
    ]
  },
  {
    id: 78,
    title: "Управление данными",
    degree: "b1",
    hours: [0, 0, 0, 3*ZE, 0, 0, 0, 0],
    description: "Курс посвящен проектированию реляционных баз данных с помощью современных СУБД. В курсе изучаются: реляционная алгебра, структура баз данных, основные операторы языка управления данными SQL, процедуры, триггеры, элементы администрирования MSSQLServer.",
    faculty: {
      name: "Кафедра ИУ3, Информационные системы и технологии",
      link: "https://iu3.bmstu.ru"
    },
    tutors: [
      "Боровик Ирина Геннадьевна"
    ],
    technologies: [
      {
        logoUrl: "icons/Oracle.webp",
        link: "https://docs.oracle.com/cd/E12151_01/index.htm"
      }
    ]
  },
  {
    id: 394,
    title: "Системы управления постреляционными базами данных",
    degree: "m",
    hours: [0, 0, 0, 3*ZE],
    description: "",
    faculty: {
      name: "Кафедра ИУ3, Информационные системы и технологии",
      link: "https://iu3.bmstu.ru"
    },
    tutors: [
      "Тихомирова Елизавета Алексеевна"
    ],
    technologies: [
      {
        logoUrl: "icons/Oracle.webp",
        link: "https://docs.oracle.com/cd/E12151_01/index.htm"
      }
    ]
  },
  {
    id: 378,
    title: "Программное обеспечение телекоммуникационных систем",
    degree: "m",
    hours: [0, 0, 0, 2*ZE],
    description: "В курсе изучается функциональный язык программирования Erlang и платформа Open Telecommunication Platform. В серии лабораторных работ исследуются основные принципы и приемы программирования на языке Erlang.",
    faculty: {
      name: "Кафедра ИУ3, Информационные системы и технологии",
      link: "https://iu3.bmstu.ru"
    },
    tutors: [
      "Сидякин Иван Михайлович"
    ],
    technologies: [
      {
        logoUrl: "icons/Erlang.webp",
        link: "https://www.erlang.org/"
      }
    ]
  },
  {
    id: 90,
    title: "Инструментальные средства информационных систем",
    degree: "b1",
    hours: [0, 0, 0, 0, 0, 0, 0, 3*ZE],
    description: "Курс содержит основные сведения об элементах внутренней архитектуры современных операционных систем, принципах разработки системного программного обеспечения, приемах проектирования установки и отладки драйверов устройств. Рассматриваются вопросы управления аппаратными ресурсами в компьютерных системах. Принципы управления памятью и организации многозадачного исполнения программ. Изучается на практике процесс разработки встраиваемой Linux системы. Применяются инструменты сборки образов загрузчика, дерева устройств, ядра и корневой файловой системы Yocto Project и Buildroot.",
    faculty: {
      name: "Кафедра ИУ3, Информационные системы и технологии",
      link: "https://iu3.bmstu.ru"
    },
    tutors: [
      "Сидякин Иван Михайлович"
    ],
    technologies: [
      {
        logoUrl: "icons/Yocto.webp",
        link: "https://www.yoctoproject.org/"
      },
      {
        logoUrl: "icons/Buildroot.webp",
        link: "https://buildroot.org/"
      },
      {
        logoUrl: "icons/ARM.webp",
        link: "https://www.arm.com/"
      },
      {
        logoUrl: "icons/Beagleboard.webp",
        link: "https://beagleboard.org/black"
      }
    ]
  },
  {
    id: 383,
    title: "Протоколы и интерфейсы информационных систем",
    degree: "m",
    hours: [2*ZE, 0, 0, 0],
    description: "Цель дисциплины состоит в изучении юзабилити пользовательского интерфейса и получению навыков практической разработки веб-сервисов. В первом модуле дисциплины рассматриваются юзабилити и опыт пользователя, когнетика и эргономика, локус внимания, режимы, монотонность, законы Фитса и Хика, методы юзабилити-тестирования. Во втором модуле рассматривается целе-ориентированное проектирование взаимодействия, принципы визуального дизайна, шаблоны проектирования, коэффициент конверсии, методология интеллектуального мультимодального интерфейса. Лабораторный практикум основан на full stack разработке веб-сервиса на базе Django.",
    faculty: {
      name: "Кафедра ИУ3, Информационные системы и технологии",
      link: "https://iu3.bmstu.ru"
    },
    tutors: [
      "Алфимцев Александр Николаевич",
      "Большаков Владислав Эдуардович"
    ],
    technologies: [
      {
        logoUrl: "icons/Django.webp",
        link: "https://www.djangoproject.com/"
      }
    ]
  },
  {
    id: 116,
    title: "Технологическая практика",
    degree: "b1",
    hours: [0, 0, 2*ZE, 2*ZE, 0, 0, 0, 0],
    description: "Задачей курса является приобретение слушателями практических навыков по построению и администрированию локальных компьютерных сетей. Рассматриваются вопросы начальной конфигурации коммутаторов и маршрутизаторов фирмы Cisco; настройка виртуальных локальных сетей (VLAN); технологии построения сетей с избыточными соединениями (STP, PVST+, RSTP); настройка маршрутизации в локальной сети; списки контроля доступа (ACL); технологии управления адресным пространством – преобразование сетевых адресов (NAT, PAT). Курс содержит 6 практических занятий.",
    faculty: {
      name: "Кафедра ИУ3, Информационные системы и технологии",
      link: "https://iu3.bmstu.ru"
    },
    tutors: [
      "Сакулин Сергей Александрович",
      "Типсин Евгений Андреевич"
    ],
    technologies: [
      {
        logoUrl: "icons/W3.webp",
        link: "https://www.w3.org/"
      }
    ]
  },
  {
    id: 390,
    title: "Мультимедиа технологии",
    degree: "m",
    hours: [0, 0, 3*ZE, 0],
    description: "Основными целями изучения дисциплины являются изучение вопросов воспроизведения мультимедийных сигналов, проектирования и инсталляции презентационных информационных систем.",
    faculty: {
      name: "Кафедра ИУ3, Информационные системы и технологии",
      link: "https://iu3.bmstu.ru"
    },
    tutors: [
      "Видьманов Дмитрий Александрович"
    ],
    technologies: [
      {
        logoUrl: "icons/Premiere.webp",
        link: "https://www.adobe.com/ru/products/premiere.html"
      },
      {
        logoUrl: "icons/Shower.webp",
        link: "https://github.com/shower/shower"
      },
      {
        logoUrl: "icons/Aurora.webp",
        link: "https://auroraos.ru/"
      }
    ]
  },
  {
    id: 380,
    title: "Программное обеспечение встроенных систем",
    degree: "m",
    hours: [3*ZE, 0, 0, 0],
    description: "Основными целями изучения дисциплины являются формирование у студентов знаний о методах и подходах к разработке программного обеспечения встроенных систем (ПОВС), операционных системах реального времени (ОСРВ), их особенностях и применении. Главными задачами освоения дисциплины является изучение процесса разработки ПОВС, стандартов и методов разработки ПОВС, возможностей, архитектуры и особенностей ОСРВ, особенностей аппаратных платформ, влияющих на разработку ПОВС.",
    faculty: {
      name: "Кафедра ИУ3, Информационные системы и технологии",
      link: "https://iu3.bmstu.ru"
    },
    tutors: [
      "Федоров Сергей Владимирович"
    ],
    technologies: [
      {
        logoUrl: "icons/Intel.webp",
        link: "https://www.intel.com/content/www/us/en/products/programmable.html"
      },
      {
        logoUrl: "icons/qC.webp",
        link: "https://weston-embedded.com/micrium-kernels"
      },
      {
        logoUrl: "icons/Quartus.webp",
        link: "https://www.intel.com/content/www/us/en/software/programmable/quartus-prime/overview.html"
      },
      {
        logoUrl: "icons/Misra.webp",
        link: "https://www.misra.org.uk/misra-c/"
      },
      {
        logoUrl: "icons/Terastic.webp",
        link: "https://www.terasic.com.tw/cgi-bin/page/archive.pl?Language=English&No=502"
      }
    ]
  },
  {
    id: 377,
    title: "Методы исследования и моделирования информационных процессов и технологий",
    degree: "m",
    hours: [0, 3*ZE, 0, 0],
    description: "Цель курса - приобретение студентами основных знаний о моделе-ориентированном программировании, системной инженерии, архитектурных фреймворках и различных видах нотации, а также освоение построения диаграмм классов, состояний и действий и приобретение базовых навыков работы с требованиями и инженерным обоснованиемприобретение студентами основных знаний о моделе-ориентированном программировании, системной инженерии, архитектурных фреймворках и различных видах нотации, а также освоение построения диаграмм классов, состояний и действий и приобретение базовых навыков работы с требованиями и инженерным обоснованием",
    faculty: {
      name: "Кафедра ИУ3, Информационные системы и технологии",
      link: "https://iu3.bmstu.ru"
    },
    tutors: [
      "Кадырбаева Анастасия Рустемовна"
    ],
    technologies: [
      {
        logoUrl: "icons/EMF.webp",
        link: "https://www.eclipse.org/modeling/emf/"
      },
      {
        logoUrl: "icons/AnyLogic.webp",
        link: "https://www.anylogic.ru/"
      }
    ]
  },
  {
    id: 379,
    title: "Системная инженерия",
    degree: "m",
    hours: [0, 0, 3*ZE, 0],
    description: "",
    faculty: {
      name: "Кафедра ИУ3, Информационные системы и технологии",
      link: "https://iu3.bmstu.ru"
    },
    tutors: [
      "Девятков Владимир Валентинович",
      "Кадырбаева Анастасия Рустемовна"
    ],
    technologies: [
      {
        logoUrl: "icons/PMS.webp",
        link: "https://www.microsoft.com/ru-ru/microsoft-365/project/project-management-software?market=ru"
      },
      {
        logoUrl: "icons/Capella.webp",
        link: "https://www.eclipse.org/capella/"
      }
    ]
  },
  {
    id: 385,
    title: "Экономика и управление инновационными проектами",
    degree: "m",
    hours: [0, 2*ZE, 0, 0],
    description: "",
    faculty: {
      name: "Кафедра ИБМ3, Промышленная логистика",
      link: "http://ibm.bmstu.ru/ibm3/"
    },
    tutors: [
      "Не указаны"
    ],
    technologies: [
      {
        logoUrl: "icons/PMS.webp",
        link: "https://www.microsoft.com/ru-ru/microsoft-365/project/project-management-software?market=ru"
      }
    ]
  },
  {
    id: 409,
    title: "Криптографические протоколы и стандарты",
    degree: "m",
    hours: [0, 0, 4*ZE, 0],
    description: "",
    faculty: {
      name: "Кафедра ИУ3, Информационные системы и технологии",
      link: "https://iu3.bmstu.ru"
    },
    tutors: [
      "Варфоломеев Александр Алексеевич"
    ],
    technologies: [
      {
        logoUrl: "icons/Cryptool.webp",
        link: "https://www.cryptool.org/en/"
      }
    ]
  },
  {
    id: 107,
    title: "Корпоративные информационные системы",
    degree: "b1",
    hours: [0, 0, 0, 0, 0, 0, 0, 2*ZE],
    description: "Курс посвящен изложению основ корпоративных информационных систем (КИС), возможностей и процессов разработки этих систем. Курс содержит сведения о предметной области, которые являются общими для потребителей и разработчиков КИС, знакомит с функциональностью КИС, формирует представления об этапах разработки КИС. В курсе излагается следующий учебный материал: понятие КИС, об унифицированном процессе и языке моделирования UML, предметная область КИС (введение в основы бухучета, логистики, управленческого учета), функциональность КИС (подсистемное и процедурное представление функциональности КИС, о методологиях MRP, MRP II, ERP и ERP II), разработка программного обеспечения КИС (описание предметной области, анализ требований, об этапах объектно-ориентированного анализа и проектирования.",
    faculty: {
      name: "Кафедра ИУ3, Информационные системы и технологии",
      link: "https://iu3.bmstu.ru"
    },
    tutors: [
      "Недашковский Вячеслав Михайлович"
    ],
    technologies: [
      {
        logoUrl: "icons/1C.webp",
        link: "https://1c.ru/"
      }
    ]
  },
  {
    id: 106,
    title: "Системы управления в информационных сетях",
    degree: "b1",
    hours: [0, 0, 0, 0, 0, 0, 0, 2*ZE],
    description: "Изучение дисциплины обеспечивает студента сведениями о современных системах управления информационными сетями и первоначальными навыками организации компьютерных сетей, настройки различных уровней безопасности в компьютерных сетях, установки и настройки основных сетевых сервисов и серверов. В читаемой дисциплине излагаются: основы администрирования Windows Server, служба глобального каталога, основные сервисы, система безопасности сервера, система учетных записей, управление локальными групповыми политиками, управление политиками сайта, домена, подразделения, система сертификации, основы настройки основных сервисов. В рамках курса предусмотрены лабораторные работы по установке и настройке основных сервисов и безопасности сервера.",
    faculty: {
      name: "Кафедра ИУ3, Информационные системы и технологии",
      link: "https://iu3.bmstu.ru"
    },
    tutors: [
      "Боровик Ирина Геннадьевна"
    ],
    technologies: [
      {
        logoUrl: "icons/WindowsServer.webp",
        link: "https://www.microsoft.com/ru-ru/windows-server"
      }
    ]
  },
  {
    id: 114,
    title: "Технологии поиска и анализа персонифицированной информации",
    degree: "b1",
    hours: [0, 0, 0, 0, 0, 0, 0, ZE],
    description: "Цель курса состоит в изучении студентами современных технологий информационного поиска, тенденций и последних достижений в этой области; получении базо-вых знаний о теоретических основах современных поисковых технологий; приобретении практических навыков использования поисковых технологий в различных областях. Рассмотрены история поисковых технологий, теоретические основы поиска: булева, векторно-пространственная, нечеткая модели поиска, структура веб-пространства, а также применение теории поиска на практике.",
    faculty: {
      name: "Кафедра ИУ3, Информационные системы и технологии",
      link: "https://iu3.bmstu.ru"
    },
    tutors: [
      "Сакулин Сергей Александрович"
    ],
    technologies: [
      {
        logoUrl: "icons/InfoRetrieval.webp",
        link: "https://ru.wikipedia.org/wiki/%D0%98%D0%BD%D1%84%D0%BE%D1%80%D0%BC%D0%B0%D1%86%D0%B8%D0%BE%D0%BD%D0%BD%D1%8B%D0%B9_%D0%BF%D0%BE%D0%B8%D1%81%D0%BA"
      }
    ]
  },
  {
    id: 224,
    title: "Проектирование информационных и телекоммуникационных систем",
    degree: "m",
    hours: [3*ZE, 0, 0, 0],
    description: "В курсе рассматриваются основные принципы проектирования распределенных систем сбора данных в области «Интернета вещей» (Internet Of Things). Основное внимание уделено особенностям беспроводных эпизодических и сенсорных многоячейковых сетей, а также вопросам разработки оконечных IoT-устройств. В рамках лабораторного практикума применяются современные средства имитационного моделирования.",
    faculty: {
      name: "Кафедра ИУ3, Информационные системы и технологии",
      link: "https://iu3.bmstu.ru"
    },
    tutors: [
      "Баскаков Сергей Сергеевич",
      "Асмарян Альберт Эдуардович"
    ],
    technologies: [
      {
        logoUrl: "icons/Zigbee.webp",
        link: "https://csa-iot.org/all-solutions/zigbee/"
      },
      {
        logoUrl: "icons/GSM.webp",
        link: "https://www.3gpp.org/"
      },
      {
        logoUrl: "icons/Wifi.webp",
        link: "https://www.wi-fi.org/"
      },
      {
        logoUrl: "icons/Bluetooth.webp",
        link: "https://www.bluetooth.com/"
      },
      {
        logoUrl: "icons/LoRa.webp",
        link: "https://lora-alliance.org/"
      },
      {
        logoUrl: "icons/OmNET.webp",
        link: "https://omnetpp.org/"
      }
    ]
  },
  {
    id: 386,
    title: "Беспроводные технологии в информационных системах",
    degree: "m",
    hours: [0, 0, 3*ZE, 0],
    description: "В рамках курса рассматриваются различные фундаментальные принципы, сетевые алгоритмы и протоколы, лежащие в основе таких современных беспроводных технологий, как Wi-Fi, Bluetooth, IEEE 802.15.4, LoRa, UWB, UNB, мобильная сотовая связь, глобальные спутниковые навигационные системы и др. Изучаются практические особенности данных технологий, которые необходимо учитывать при разработке устройств в области «Интернета вещей» (Internet Of Things) как на базе стандартных, так и на основе специализированных решений. В лабораторном практикуме используются современные средства имитационного и математического моделирования.",
    faculty: {
      name: "Кафедра ИУ3, Информационные системы и технологии",
      link: "https://iu3.bmstu.ru"
    },
    tutors: [
      "Баскаков Сергей Сергеевич"
    ],
    technologies: [
      {
        logoUrl: "icons/Zigbee.webp",
        link: "https://csa-iot.org/all-solutions/zigbee/"
      },
      {
        logoUrl: "icons/GSM.webp",
        link: "https://www.3gpp.org/"
      },
      {
        logoUrl: "icons/Wifi.webp",
        link: "https://www.wi-fi.org/"
      },
      {
        logoUrl: "icons/Bluetooth.webp",
        link: "https://www.bluetooth.com/"
      },
      {
        logoUrl: "icons/LoRa.webp",
        link: "https://lora-alliance.org/"
      },
      {
        logoUrl: "icons/OmNET.webp",
        link: "https://omnetpp.org/"
      }
    ]
  },
  {
    id: 76,
    title: "Инфокоммуникационные системы и сети",
    degree: "b1",
    hours: [0, 5*ZE, 0, 0, 0, 0, 0, 0],
    description: "Курс содержит основные сведения об инфокоммуникационных сетях и системах. Рассматривается история развития информационных сетей, методы передачи данных, модели взаимодействия информационных систем. Изучаются технологии локальных сетей, протоколы Интернет, маршрутизация в сетях. Курс содержит домашнее задание по распределению адресного пространства и пять лабораторных работ, проводимых на реальном оборудовании в лабораториях кафедры. В рамках курса проводится экскурсия в центр обработки данных Mail.Ru.",
    faculty: {
      name: "Кафедра ИУ3, Информационные системы и технологии",
      link: "https://iu3.bmstu.ru"
    },
    tutors: [
      "Тихомирова Елизавета Алексеевна",
      "Родионов Илия Дмитриевич"
    ],
    technologies: [
      {
        logoUrl: "icons/Cisco.webp",
        link: "https://www.cisco.com/"
      }
    ]
  },
  {
    id: 117,
    title: "Проектно-технологическая практика",
    degree: "b1",
    hours: [0, ZE, 0, 0, 0, 0, 0, 0],
    description: "Задачей курса является приобретение слушателями практических навыков по построению и администрированию локальных компьютерных сетей. Рассматриваются вопросы начальной конфигурации коммутаторов и маршрутизаторов фирмы Cisco; настройка виртуальных локальных сетей (VLAN); технологии построения сетей с избыточными соединениями (STP, PVST+, RSTP); настройка маршрутизации в локальной сети; списки контроля доступа (ACL); технологии управления адресным пространством – преобразование сетевых адресов (NAT, PAT). Курс содержит 6 практических занятий.",
    faculty: {
      name: "Кафедра ИУ3, Информационные системы и технологии",
      link: "https://iu3.bmstu.ru"
    },
    tutors: [
      "Родионов Илия Дмитриевич"
    ],
    technologies: [
      {
        logoUrl: "icons/Cisco.webp",
        link: "https://www.cisco.com/"
      }
    ]
  },
  {
    id: 392,
    title: "Инжиниринг компьютерных сетей",
    degree: "m",
    hours: [0, 0, 0, 3*ZE],
    description: "Цель изучения дисциплины заключается в приобретении знаний теоретических основ и практической реализации методов инжиниринга трафика при решении задачи выбора маршрутов для потоков (или классов) трафика с учетом соблюдения требований обеспечения качества обслуживания, и обеспечения устойчивой работы современных мультимедийных приложений, таких как IP-телефония, видео- и радиовещание, интерактивное дистанционное обучение.",
    faculty: {
      name: "Кафедра ИУ3, Информационные системы и технологии",
      link: "https://iu3.bmstu.ru"
    },
    tutors: [
      "Видьманов Дмитрий Александрович"
    ],
    technologies: [
      {
        logoUrl: "icons/Cisco.webp",
        link: "https://www.cisco.com/"
      },
      {
        logoUrl: "icons/GNS3.webp",
        link: "https://www.gns3.com/"
      }
    ]
  },
  {
    id: 226,
    title: "Нейронные сети",
    degree: "m",
    hours: [3*ZE, 0, 0, 0],
    description: "Курс посвящен архитектуре современных нейронных сетей. В курсе рассматриваются основные модели нейронных сетей, их обучение, работа и особенности применения для решения практических задач. В практической части курса студенты решают задачу распознавания рукописного текста.",
    faculty: {
      name: "Кафедра ИУ3, Информационные системы и технологии",
      link: "https://iu3.bmstu.ru"
    },
    tutors: [
      "Боровик Ирина Геннадьевна"
    ],
    technologies: [
      {
        logoUrl: "icons/Neuroph.webp",
        link: "http://neuroph.sourceforge.net/index.html"
      }
    ]
  },
  {
    id: 86,
    title: "Интеллектуальные системы и технологии",
    degree: "b1",
    hours: [0, 0, 0, 0, 0, 0, 4*ZE, 0],
    description: "Цель изучения дисциплины - приобретение студентами основных знаний об интеллектуальных системах, состоящих из интеллектуальных взаимодействующих агентов, развитие понимания технологий построения символически, рефлексивно, реактивно и гибридно рассуждающих агентов, стратегий их взаимодействия и кооперации при решении практических задач в различных средах",
    faculty: {
      name: "Кафедра ИУ3, Информационные системы и технологии",
      link: "https://iu3.bmstu.ru"
    },
    tutors: [
      "Девятков Владимир Валентинович",
      "Лычков Игорь Игоревич"
    ],
    technologies: [
      {
        logoUrl: "icons/SWI.webp",
        link: "https://www.swi-prolog.org/"
      }
    ]
  },
  {
    id: 223,
    title: "Представление знаний в информационных системах",
    degree: "m",
    hours: [0, 3*ZE, 0, 0],
    description: "Основной целью изучения дисциплины является приобретение теоретических знаний и практических навыков в области проектирования интеллектуальных информационных систем, функционирующих на основе формального представления знаний. Главными задачами освоения дисциплины являются формирование и развитие у студентов фундаментальных знаний о построении интеллектуальных информационных систем и технологий, базирующихся на работе с различными языками и моделями представления знаний и использующих логическое программирование интеллектуальных задач.",
    faculty: {
      name: "Кафедра ИУ3, Информационные системы и технологии",
      link: "https://iu3.bmstu.ru"
    },
    tutors: [
      "Девятков Владимир Валентинович",
      "Лычков Игорь Игоревич"
    ],
    technologies: [
      {
        logoUrl: "icons/SWI.webp",
        link: "https://www.swi-prolog.org/"
      }
    ]
  },
  {
    id: 225,
    title: "Мультиагентные интеллектуальные системы",
    degree: "m",
    hours: [0, 0, 3*ZE, 0],
    description: "Цель дисциплины - сформировать профессиональные компетенции по проектированию мультиагентных систем на базе технологий машинного обучения. В первом модуле «Интеллектуальный агент и мультиагентные организации» рассматриваются мультиагентные архитектуры, свойства агентов, отличия агентно-ориентированной парадигмы программирования от объектно-ориентированной, мультиагентные системы (МАС) и организации. В модуле «Разработка и математические основы мультиагентной системы» рассматриваются вопросы использования логики в МАС, теории игр в МАС, мультиагентного планирования, машинного обучение в МАС, мультиагентного обучения, обучения с подкреплением, а также марковское принятие решения, байесовый логический вывод, эволюционные методы, коллективный искусственный интеллект, нейронные сети и глубокое обучение на больших данных в МАС. Лабораторные работы используют топовые методологии проектирования Mase, Gaia, Agile Passi для создания МАС на базе современных платформ mini-RTS (SMAC, OpenAI).",
    faculty: {
      name: "Кафедра ИУ3, Информационные системы и технологии",
      link: "https://iu3.bmstu.ru"
    },
    tutors: [
      "Алфимцев Александр Николаевич",
      "Большаков Владислав Эдуардович"
    ],
    technologies: [
      {
        logoUrl: "icons/PyTorch.webp",
        link: "https://pytorch.org/"
      }
    ]
  },
  {
    id: 388,
    title: "Проектирование цифровых устройств на программируемых логических интегральных схемах",
    degree: "m",
    hours: [0, 0, 4*ZE, 0],
    description: "",
    faculty: {
      name: "Кафедра ИУ3, Информационные системы и технологии",
      link: "https://iu3.bmstu.ru"
    },
    tutors: [
      "Фёдоров Сергей Владимирович"
    ],
    technologies: [
      {
        logoUrl: "icons/Intel.webp",
        link: "https://www.intel.com/content/www/us/en/products/programmable.html"
      },
      {
        logoUrl: "icons/ModelSim.webp",
        link: "https://resources.sw.siemens.com/en-US/fact-sheet-modelsim-cost-effective-simulation-fact-sheet"
      },
      {
        logoUrl: "icons/Quartus.webp",
        link: "https://www.intel.com/content/www/us/en/software/programmable/quartus-prime/overview.html"
      },
      {
        logoUrl: "icons/Terasic.webp",
        link: "https://www.terasic.com.tw/cgi-bin/page/archive.pl?Language=English&No=502"
      }
    ]
  },
  {
    id: 99,
    title: "Схемотехника электронных устройств. Курсовая работа",
    degree: "b1",
    hours: [0, 0, 0, 0, 0, 2*ZE, 0, 0],
    description: "Курсовая работа выполняется по индивидуальным заданиям. В процессе работы на курсовой работой выполняется анализ возможных схемотехнических решений, разрабатывается функциональная схема, осуществляется выбор элементной базы, проводятся необходимые расчеты, разрабатывается принципиальная электрическая схема. Работоспособность схемы и правильность проведенных расчетов подтверждаются моделированием.",
    faculty: {
      name: "Кафедра ИУ3, Информационные системы и технологии",
      link: "https://iu3.bmstu.ru"
    },
    tutors: [
      "Баскаков Сергей Сергеевич",
      "Оганов Владимир Игоревич",
      "Федоров Сергей Владимирович",
      "Бабкин Павел Сергеевич",
      "Германчук Александр Игоревич",
      "Амурский Владислав Брониславович",
      "Семенцов Станислав Григорьевич"
    ],
    technologies: [
      {
        logoUrl: "icons/TI.webp",
        link: "https://www.ti.com/"
      },
      {
        logoUrl: "icons/MultiSim.webp",
        link: "https://www.multisim.com/"
      },
      {
        logoUrl: "icons/NASA.webp",
        link: "https://www.nasa.gov/feature/goddard/2020/space-communications-7-things-you-need-to-know"
      },
      {
        logoUrl: "icons/Autodesk.webp",
        link: "https://asean.autodesk.com/solutions/circuit-design-software"
      }
    ]
  },
  {
    id: 98,
    title: "Метрология и информационно-измерительные устройства",
    degree: "b1",
    hours: [0, 0, 0, 0, 4*ZE, 0, 0, 0],
    description: "Исследуются различные методы измерения и анализируются связанные с ними случайные, систематические и инструментальные составляющие погрешности. Рассматривается связь между классическим представлением энергии и квантовым. Исследуется области применения формулы Планка для расчёта интенсивности излучения абсолютно чёрного тела (а. ч. т.). Курса построен на базе графического языка программирования LabVIEW.",
    faculty: {
      name: "Кафедра ИУ3, Информационные системы и технологии",
      link: "https://iu3.bmstu.ru"
    },
    tutors: [
      "Петросян Олег Гарегинович"
    ],
    technologies: [
      {
        logoUrl: "icons/LabView.webp",
        link: "https://labview.izmeril.ru/"
      }
    ]
  },
  {
    id: 96,
    title: "Электроника",
    degree: "b1",
    hours: [0, 0, 0, 5*ZE, 0, 0, 0, 0],
    description: "Курс включен в цикл общепрофессиональных дисциплин. Задачами дисциплины являются формирование у студентов фундаментальных знаний в области электронных цепей и информационных сигналов, развитие физических представлений об основных процессах в электронных системах и устройствах, формирование представлений о математических моделях основных классов сигналов в электронных устройствах и методах их моделирования.",
    faculty: {
      name: "Кафедра ИУ3, Информационные системы и технологии",
      link: "https://iu3.bmstu.ru"
    },
    tutors: [
      "Амурский Владислав Брониславович",
      "Семенцов Станислав Григорьевич"
    ],
    technologies: [
      {
        logoUrl: "icons/MultiSim.webp",
        link: "https://www.multisim.com/"
      },
      {
        logoUrl: "icons/Autodesk.webp",
        link: "https://asean.autodesk.com/solutions/circuit-design-software"
      }
    ]
  },
  {
    id: 307,
    title: "Технологии программирования",
    degree: "b2",
    hours: [0, 0, 0, 0, 3*ZE, 0, 0, 0],
    description: "Курс содержит сведения об основах разработки программного обеспечения на языке С#. В курсе рассматривается синтаксис языка; принципы объектно-ориентированного программирования; стиль программирования и правила документирования программ. Изучаются основы проектирования графического пользовательского интерфейса; практические приемы работы с различными видами коллекций; файловый ввод вывод; сокеты; вопросы проектирования многозадачных приложений. Курс включает восемь практических заданий.",
    faculty: {
      name: "Кафедра ИУ3, Информационные системы и технологии",
      link: "https://iu3.bmstu.ru"
    },
    tutors: [
      "Видьманов Дмитрий Александрович"
    ],
    technologies: [
      {
        logoUrl: "icons/NET.webp",
        link: "https://dotnet.microsoft.com/en-us/"
      },
      {
        logoUrl: "icons/C#.webp",
        link: "https://learn.microsoft.com/en-us/dotnet/csharp/"
      }
    ]
  }
];
