export default [
  {
    title: "Лаборатория микропроцессорной техники",
    description: [
      "На кафедре серьезное внимание уделяется изучению микропроцессорной техники как ключевой составляющей современного телекоммуникационного оборудования и информационно-измерительных систем.",
      "На практических занятиях, проводимых в лаборатории микропроцессорной техники, студенты получают навыки программирования на языке ассемблер, учатся проектировать микропроцессорные системы, используя стандартные комплекты микросхем, изучают устройство и принципы работы различных микропроцессорных интерфейсов, рассматривают вопросы сопряжения различных периферийных устройств с микропроцессорами.",
      "Используя полученные знания, студенты осваивают работу со сложными микропроцессорными системами, используя фирменные программные и аппаратные средства проектирования. В частности, они получают знания для решения задач цифровой обработки сигналов звукового диапазона частот в реальном масштабе времени на платформах современных сигнальных процессоров, получают навыки проектирования программного обеспечения для высокопроизводительных сигнальных процессоров используя специализированные отладочные платы и внутрисхемные эмуляторы.",
      "Кафедра является членом университетских программ ведущих мировых производителей – Analog Devices, Тexas Instruments, Cypress Semicondictor, National Semiconductor. Благодаря этому, лаборатория оснащена современными программными и аппаратными средствами проектирования сигнальных процессоров и систем на кристалле.",
      "Используя ресурсы лаборатории, студенты могут в рамках научно-исследовательской работы, а также курсового и дипломного проектирования решать интересные задачи, создавать реальные электронные микропроцессорные устройства.",
      "Многие выпускники кафедры, ставшие успешными специалистами в области проектирования микропроцессорных систем, сделали первые практические шаги в этой области именно в стенах лаборатории микропроцессорной техники."
    ],
    photos: [
      "images/analog-devices.webp",
      "images/texas-instruments.webp",
      "images/cypress.webp",
      "images/national-semiconductor.webp"
    ]
  },
  {
    title: "Лаборатория телекоммуникационых технологий",
    description: [
      "В этой лаборатории студенты осваивают сетевые технологии, используя оборудование ведущего мирового производителя в этой области - фирмы Cisco. Преподавание ведется с использованием современных средств технического обучения. Лабораторное оборудование и учебные материалы предоставлены в рамках программы локальной сетевой академии CISCO. Студены кафедры могут получить международные квалификационные сертификаты по программам сетевой академии. Студенты изучают сетевые технологии и протоколы, принципы построения, настройки и сопровождения локальных и глобальных вычислительных сетей."
    ],
    photos: [
      "images/cisco-systems.webp"
    ]
  },
  {
    title: "Лаборатория электроники",
    description: [
      "В лаборатории электроники проводятся занятия по изучению основ электроники, проектирования аналоговых и цифровых электронных устройств, измерительной техники. Лаборатория электроники оснащена профессиональным контрольно-измерительным оборудованием: цифровыми осциллографами, мультиметрами, функциональными генераторами, блоками питания, а также вычислительной техникой. В лаборатории студенты проводят научно-исследовательские работы в рамках курсового и дипломного проектирования."
    ],
    photos: []
  },
  {
    title: "Лаборатория проектирования цифровых устройств",
    description: [
      "В лаборатории проводятся практические занятия по проектированию ПЛИС (программируемых логических интегральных схем) и созданию на их основе систем на кристалле. Преподавание ведется на элементной базе ведущего производителя в этой области – фирмы ALTERA. Технология программируемых логических интегральных схем позволяет создавать специализированные цифровые микросхемы, не привлекая производственные ресурсы, используя только персональный компьютер и аппаратные средства конфигурации микросхемы.",
      "Студенты осваивают различные составляющие процесса проектирования цифровых устройств. Изучают языки описания цифровых устройств, приемы и методы корректного проектирования цифровой схемотехники на ПЛИС. Также изучается проектирование систем на кристалле на базе ПЛИС. Используя ресурсы микросхемы ПЛИС, на одном кристалле можно разместить процессорное ядро, память, необходимые цифровые модули и интерфейсы. Так обеспечивается интеграция всей микропроцессорной системы в одну микросхему. Такой подход позволяет создавать узлы и модули современных телекоммуникационных и информационных систем с минимальными массогабаритными характеристиками и высокой производительностью.",
      "В процессе обучения студенты получают навыки создания и конфигурирования системы на кристалле, ее сопряжения с пользовательскими модулями и внешними компонентами, а также навыки разработки программного обеспечения для процессорных модулей.",
      "В рамках университетской программы фирмы ALTERA лаборатория оснащена специализированными отладочными стендами и САПР Quartus. Преподавание осуществляют сертифицированные фирмой ALTERA специалисты.",
      "Многие выпускники кафедры, ставшие успешными специалистами в области проектирования микропроцессорных систем, сделали первые практические шаги в этой области в стенах лаборатории проектирования цифровых устройств.",
      "На базе лаборатории также осуществляется повышение квалификации специалистов в рамках действующего на кафедре официального центра обучения фирмы ALTERA."
    ],
    photos: [
      "images/altera-logo.webp"
    ]
  },
  {
    title: "Лаборатория человеко-машинного взаимодействия",
    description: [
      "Лаборатория человеко-машинного взаимодействия (ЧМВ) на кафедре ИУ-3 организована в 2005 г. Целью создания лаборатории являлась организация научно-исследовательской группы, состоящей из преподавателей, аспирантов и студентов, для проведения исследований в области интеллектуальных человеко-машинных интерфейсов (компьютер, робот, бытовое оборудование), основанных на методах искусственного интеллекта, компьютерного зрения и распознавания образов. Результаты исследований активно внедряются в учебный процесс кафедры в курсах: \"Представление знаний в информационных системах\", \"Интерфейсы информационных систем\", \"Цифровая обработка изображений\", \"Разработка программного обеспечения\".",
      "В рамках НИР с фирмами Philips и NXP Semiconductors была разработана система мультимодального управления телевизором.",
      "Совместно с AgentLab в лаборатории проводятся исследования мультиагентных систем, как для обеспечения агентно-диалоговых интерфейсов человек-машина, так и для анализа рынка акций, развития игр (автоматическое управление персонажем в SecondLife), моделирования искусственной жизни."
    ],
    photos: [
      "images/philips.webp"
    ]
  }
];
